### Ingest data from college

In [4]:
datasett = "college_data"

In [5]:
!bq --location=US mk --dataset {datasett}

BigQuery error in mk operation: Dataset 'sashimi-266523:college_data' already
exists.

In [8]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {datasett}.Classes \
'gs://college_data_maiiihn/Classes.csv'

Waiting on bqjob_r5bf7ac892925734a_000001700db2fc32_1 ... (1s) Current status: DONE

In [6]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {datasett}.Current_Students \
'gs://college_data_maiiihn/Current_Students.csv'

Waiting on bqjob_r383e63e11956798b_000001700dc58bf6_1 ... (2s) Current status: DONE

In [7]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {datasett}.New_Students \
'gs://college_data_maiiihn/New_Students.csv'

Waiting on bqjob_r555ec004f9b04364_000001700dc5effe_1 ... (1s) Current status: DONE

### Get record count for all 3 tables

In [10]:
%%bigquery
select count(*) from college_data.Classes

   f0_
0   26

In [11]:
%%bigquery
select count(*) as count from college_data.Current_Students

   count
0     13

In [12]:
%%bigquery
select count(*) as count from college_data.New_Students

   count
0      7

### Read sample records from tables

In [13]:
%%bigquery
select * from college_data.Classes
limit 5

,tid,instructor,dept,cno,cname,credits
0,fares,Fares Fraij,CS,CS331E,Elements of Software Engineering,3
1,abraham,Prof. Sarah Abraham,CS,CS329E,Elements of Mobile Computing,3
2,mitra,"Mitra, Shyamal",CS,CS313E,Elements of Software Design,3
3,cannata,PHILIP CANNATA,CS,CS326E,Elements of Networking,3
4,cannata,"Cannata, Philip",CS,CS347,Data Management,3

In [14]:
%%bigquery
select * from college_data.Current_Students
limit 5

,sid,fname,lname,dob,cno,cname,credits,grade
0,kev18,Kevin,Lin,05/10/1999,CS329E,Elements of Web Programming,3,None
1,paulg,Paul,Gore,2000-09-17,CS329E,Elements of Web Programming,3,A
2,paulg,Paul,Gore,2000-09-17,CS326E - Fall18,Elements of Networking,3,A-
3,paulg,Paul,Gore,09/17/2000,CS313E,Elements of Software Design,3,None
4,bzen26,Biswa,Zen,04/22/1998,CS313E - Fall18,Elements of Software Design,3,B+

In [15]:
%%bigquery
select * from college_data.New_Students
limit 5

        sid    fname     lname         dob
0    aprilz    April     Lopez  2000-01-10
1  sudeepa4  Sudeepa       Roy  2000-10-01
2    ryan22     Ryan    Watson  2000-11-07
3     dchen    David      Chen  2000-08-22
4     natea   Nathan  Anderson  2000-04-08